Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/pwm.h
#define PWM_DIS_CHID_Pos                    0                                              /**< (PWM_DIS Position) Channel ID */
#define PWM_DIS_CHID_Msk                    (_U_(0xF) << PWM_DIS_CHID_Pos)                 /**< (PWM_DIS Mask) CHID */
#define PWM_DIS_CHID(value)                 (PWM_DIS_CHID_Msk & ((value) << PWM_DIS_CHID_Pos))  

/* -------- PWM_SR : (PWM Offset: 0x0c) (R/ 32) PWM Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CHID0:1;                   /**< bit:      0  Channel ID                               */
    uint32_t CHID1:1;                   /**< bit:      1  Channel ID                               */
    uint32_t CHID2:1;                   /**< bit:      2  Channel ID                               */
    uint32_t CHID3:1;                   /**< bit:      3  Channel ID                               */
    uint32_t :28;                       /**< bit:  4..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CHID:4;                    /**< bit:   0..3  Channel ID                               */
    uint32_t :28;                       /**< bit:  4..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_SR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_SR_OFFSET                       (0x0C)                                        /**<  (PWM_SR) PWM Status Register  Offset */

#define PWM_SR_CHID0_Pos                    0                                              /**< (PWM_SR) Channel ID Position */
#define PWM_SR_CHID0_Msk                    (_U_(0x1) << PWM_SR_CHID0_Pos)                 /**< (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID0                        PWM_SR_CHID0_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SR_CHID0_Msk instead */
#define PWM_SR_CHID1_Pos                    1                                              /**< (PWM_SR) Channel ID Position */
#define PWM_SR_CHID1_Msk                    (_U_(0x1) << PWM_SR_CHID1_Pos)                 /**< (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID1                        PWM_SR_CHID1_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SR_CHID1_Msk instead */
#define PWM_SR_CHID2_Pos                    2                                              /**< (PWM_SR) Channel ID Position */
#define PWM_SR_CHID2_Msk                    (_U_(0x1) << PWM_SR_CHID2_Pos)                 /**< (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID2                        PWM_SR_CHID2_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SR_CHID2_Msk instead */
#define PWM_SR_CHID3_Pos                    3                                              /**< (PWM_SR) Channel ID Position */
#define PWM_SR_CHID3_Msk                    (_U_(0x1) << PWM_SR_CHID3_Pos)                 /**< (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID3                        PWM_SR_CHID3_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_SR_CHID3_Msk instead */
#define PWM_SR_MASK                         _U_(0x0F)                                      /**< \deprecated (PWM_SR) Register MASK  (Use PWM_SR_Msk instead)  */
#define PWM_SR_Msk                          _U_(0x0F)                                      /**< (PWM_SR) Register Mask  */

#define PWM_SR_CHID_Pos                     0                                              /**< (PWM_SR Position) Channel ID */
#define PWM_SR_CHID_Msk                     (_U_(0xF) << PWM_SR_CHID_Pos)                  /**< (PWM_SR Mask) CHID */
#define PWM_SR_CHID(value)                  (PWM_SR_CHID_Msk & ((value) << PWM_SR_CHID_Pos))  

/* -------- PWM_IER1 : (PWM Offset: 0x10) (/W 32) PWM Interrupt Enable Register 1 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CHID0:1;                   /**< bit:      0  Counter Event on Channel 0 Interrupt Enable */
    uint32_t CHID1:1;                   /**< bit:      1  Counter Event on Channel 1 Interrupt Enable */
    uint32_t CHID2:1;                   /**< bit:      2  Counter Event on Channel 2 Interrupt Enable */
    uint32_t CHID3:1;                   /**< bit:      3  Counter Event on Channel 3 Interrupt Enable */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t FCHID0:1;                  /**< bit:     16  Fault Protection Trigger on Channel 0 Interrupt Enable */
    uint32_t FCHID1:1;                  /**< bit:     17  Fault Protection Trigger on Channel 1 Interrupt Enable */
    uint32_t FCHID2:1;                  /**< bit:     18  Fault Protection Trigger on Channel 2 Interrupt Enable */
    uint32_t FCHID3:1;                  /**< bit:     19  Fault Protection Trigger on Channel 3 Interrupt Enable */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t CHID:4;                    /**< bit:   0..3  Counter Event on Channel x Interrupt Enable */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t FCHID:4;                   /**< bit: 16..19  Fault Protection Trigger on Channel 3 Interrupt Enable */
    uint32_t :12;                       /**< bit: 20..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_IER1_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_IER1_OFFSET                     (0x10)                                        /**<  (PWM_IER1) PWM Interrupt Enable Register 1  Offset */

