Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/pwm.h
#define PWM_OS_OSH_Pos                      0                                              /**< (PWM_OS Position) Output Selection for PWMH output of the channel x */
#define PWM_OS_OSH_Msk                      (_U_(0xF) << PWM_OS_OSH_Pos)                   /**< (PWM_OS Mask) OSH */
#define PWM_OS_OSH(value)                   (PWM_OS_OSH_Msk & ((value) << PWM_OS_OSH_Pos))  
#define PWM_OS_OSL_Pos                      16                                             /**< (PWM_OS Position) Output Selection for PWML output of the channel 3 */
#define PWM_OS_OSL_Msk                      (_U_(0xF) << PWM_OS_OSL_Pos)                   /**< (PWM_OS Mask) OSL */
#define PWM_OS_OSL(value)                   (PWM_OS_OSL_Msk & ((value) << PWM_OS_OSL_Pos))  

/* -------- PWM_OSS : (PWM Offset: 0x4c) (/W 32) PWM Output Selection Set Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t OSSH0:1;                   /**< bit:      0  Output Selection Set for PWMH output of the channel 0 */
    uint32_t OSSH1:1;                   /**< bit:      1  Output Selection Set for PWMH output of the channel 1 */
    uint32_t OSSH2:1;                   /**< bit:      2  Output Selection Set for PWMH output of the channel 2 */
    uint32_t OSSH3:1;                   /**< bit:      3  Output Selection Set for PWMH output of the channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t OSSL0:1;                   /**< bit:     16  Output Selection Set for PWML output of the channel 0 */
    uint32_t OSSL1:1;                   /**< bit:     17  Output Selection Set for PWML output of the channel 1 */
    uint32_t OSSL2:1;                   /**< bit:     18  Output Selection Set for PWML output of the channel 2 */
    uint32_t OSSL3:1;                   /**< bit:     19  Output Selection Set for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t OSSH:4;                    /**< bit:   0..3  Output Selection Set for PWMH output of the channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved */
    uint32_t OSSL:4;                    /**< bit: 16..19  Output Selection Set for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PWM_OSS_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_OSS_OFFSET                      (0x4C)                                        /**<  (PWM_OSS) PWM Output Selection Set Register  Offset */

#define PWM_OSS_OSSH0_Pos                   0                                              /**< (PWM_OSS) Output Selection Set for PWMH output of the channel 0 Position */
#define PWM_OSS_OSSH0_Msk                   (_U_(0x1) << PWM_OSS_OSSH0_Pos)                /**< (PWM_OSS) Output Selection Set for PWMH output of the channel 0 Mask */
#define PWM_OSS_OSSH0                       PWM_OSS_OSSH0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSS_OSSH0_Msk instead */
#define PWM_OSS_OSSH1_Pos                   1                                              /**< (PWM_OSS) Output Selection Set for PWMH output of the channel 1 Position */
#define PWM_OSS_OSSH1_Msk                   (_U_(0x1) << PWM_OSS_OSSH1_Pos)                /**< (PWM_OSS) Output Selection Set for PWMH output of the channel 1 Mask */
#define PWM_OSS_OSSH1                       PWM_OSS_OSSH1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSS_OSSH1_Msk instead */
#define PWM_OSS_OSSH2_Pos                   2                                              /**< (PWM_OSS) Output Selection Set for PWMH output of the channel 2 Position */
#define PWM_OSS_OSSH2_Msk                   (_U_(0x1) << PWM_OSS_OSSH2_Pos)                /**< (PWM_OSS) Output Selection Set for PWMH output of the channel 2 Mask */
#define PWM_OSS_OSSH2                       PWM_OSS_OSSH2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSS_OSSH2_Msk instead */
#define PWM_OSS_OSSH3_Pos                   3                                              /**< (PWM_OSS) Output Selection Set for PWMH output of the channel 3 Position */
#define PWM_OSS_OSSH3_Msk                   (_U_(0x1) << PWM_OSS_OSSH3_Pos)                /**< (PWM_OSS) Output Selection Set for PWMH output of the channel 3 Mask */
#define PWM_OSS_OSSH3                       PWM_OSS_OSSH3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSS_OSSH3_Msk instead */
#define PWM_OSS_OSSL0_Pos                   16                                             /**< (PWM_OSS) Output Selection Set for PWML output of the channel 0 Position */
#define PWM_OSS_OSSL0_Msk                   (_U_(0x1) << PWM_OSS_OSSL0_Pos)                /**< (PWM_OSS) Output Selection Set for PWML output of the channel 0 Mask */
#define PWM_OSS_OSSL0                       PWM_OSS_OSSL0_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSS_OSSL0_Msk instead */
#define PWM_OSS_OSSL1_Pos                   17                                             /**< (PWM_OSS) Output Selection Set for PWML output of the channel 1 Position */
#define PWM_OSS_OSSL1_Msk                   (_U_(0x1) << PWM_OSS_OSSL1_Pos)                /**< (PWM_OSS) Output Selection Set for PWML output of the channel 1 Mask */
#define PWM_OSS_OSSL1                       PWM_OSS_OSSL1_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSS_OSSL1_Msk instead */
#define PWM_OSS_OSSL2_Pos                   18                                             /**< (PWM_OSS) Output Selection Set for PWML output of the channel 2 Position */
#define PWM_OSS_OSSL2_Msk                   (_U_(0x1) << PWM_OSS_OSSL2_Pos)                /**< (PWM_OSS) Output Selection Set for PWML output of the channel 2 Mask */
#define PWM_OSS_OSSL2                       PWM_OSS_OSSL2_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSS_OSSL2_Msk instead */
#define PWM_OSS_OSSL3_Pos                   19                                             /**< (PWM_OSS) Output Selection Set for PWML output of the channel 3 Position */
#define PWM_OSS_OSSL3_Msk                   (_U_(0x1) << PWM_OSS_OSSL3_Pos)                /**< (PWM_OSS) Output Selection Set for PWML output of the channel 3 Mask */
#define PWM_OSS_OSSL3                       PWM_OSS_OSSL3_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSS_OSSL3_Msk instead */
#define PWM_OSS_MASK                        _U_(0xF000F)                                   /**< \deprecated (PWM_OSS) Register MASK  (Use PWM_OSS_Msk instead)  */
#define PWM_OSS_Msk                         _U_(0xF000F)                                   /**< (PWM_OSS) Register Mask  */

#define PWM_OSS_OSSH_Pos                    0                                              /**< (PWM_OSS Position) Output Selection Set for PWMH output of the channel x */
#define PWM_OSS_OSSH_Msk                    (_U_(0xF) << PWM_OSS_OSSH_Pos)                 /**< (PWM_OSS Mask) OSSH */
#define PWM_OSS_OSSH(value)                 (PWM_OSS_OSSH_Msk & ((value) << PWM_OSS_OSSH_Pos))  
#define PWM_OSS_OSSL_Pos                    16                                             /**< (PWM_OSS Position) Output Selection Set for PWML output of the channel 3 */
#define PWM_OSS_OSSL_Msk                    (_U_(0xF) << PWM_OSS_OSSL_Pos)                 /**< (PWM_OSS Mask) OSSL */
#define PWM_OSS_OSSL(value)                 (PWM_OSS_OSSL_Msk & ((value) << PWM_OSS_OSSL_Pos))  

