Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/pwm.h
#define PWM_OSCUPD_OFFSET                   (0x58)                                        /**<  (PWM_OSCUPD) PWM Output Selection Clear Update Register  Offset */

#define PWM_OSCUPD_OSCUPH0_Pos              0                                              /**< (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 0 Position */
#define PWM_OSCUPD_OSCUPH0_Msk              (_U_(0x1) << PWM_OSCUPD_OSCUPH0_Pos)           /**< (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 0 Mask */
#define PWM_OSCUPD_OSCUPH0                  PWM_OSCUPD_OSCUPH0_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSCUPD_OSCUPH0_Msk instead */
#define PWM_OSCUPD_OSCUPH1_Pos              1                                              /**< (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 1 Position */
#define PWM_OSCUPD_OSCUPH1_Msk              (_U_(0x1) << PWM_OSCUPD_OSCUPH1_Pos)           /**< (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 1 Mask */
#define PWM_OSCUPD_OSCUPH1                  PWM_OSCUPD_OSCUPH1_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSCUPD_OSCUPH1_Msk instead */
#define PWM_OSCUPD_OSCUPH2_Pos              2                                              /**< (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 2 Position */
#define PWM_OSCUPD_OSCUPH2_Msk              (_U_(0x1) << PWM_OSCUPD_OSCUPH2_Pos)           /**< (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 2 Mask */
#define PWM_OSCUPD_OSCUPH2                  PWM_OSCUPD_OSCUPH2_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSCUPD_OSCUPH2_Msk instead */
#define PWM_OSCUPD_OSCUPH3_Pos              3                                              /**< (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 3 Position */
#define PWM_OSCUPD_OSCUPH3_Msk              (_U_(0x1) << PWM_OSCUPD_OSCUPH3_Pos)           /**< (PWM_OSCUPD) Output Selection Clear for PWMH output of the channel 3 Mask */
#define PWM_OSCUPD_OSCUPH3                  PWM_OSCUPD_OSCUPH3_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSCUPD_OSCUPH3_Msk instead */
#define PWM_OSCUPD_OSCUPL0_Pos              16                                             /**< (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 0 Position */
#define PWM_OSCUPD_OSCUPL0_Msk              (_U_(0x1) << PWM_OSCUPD_OSCUPL0_Pos)           /**< (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 0 Mask */
#define PWM_OSCUPD_OSCUPL0                  PWM_OSCUPD_OSCUPL0_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSCUPD_OSCUPL0_Msk instead */
#define PWM_OSCUPD_OSCUPL1_Pos              17                                             /**< (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 1 Position */
#define PWM_OSCUPD_OSCUPL1_Msk              (_U_(0x1) << PWM_OSCUPD_OSCUPL1_Pos)           /**< (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 1 Mask */
#define PWM_OSCUPD_OSCUPL1                  PWM_OSCUPD_OSCUPL1_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSCUPD_OSCUPL1_Msk instead */
#define PWM_OSCUPD_OSCUPL2_Pos              18                                             /**< (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 2 Position */
#define PWM_OSCUPD_OSCUPL2_Msk              (_U_(0x1) << PWM_OSCUPD_OSCUPL2_Pos)           /**< (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 2 Mask */
#define PWM_OSCUPD_OSCUPL2                  PWM_OSCUPD_OSCUPL2_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSCUPD_OSCUPL2_Msk instead */
#define PWM_OSCUPD_OSCUPL3_Pos              19                                             /**< (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 3 Position */
#define PWM_OSCUPD_OSCUPL3_Msk              (_U_(0x1) << PWM_OSCUPD_OSCUPL3_Pos)           /**< (PWM_OSCUPD) Output Selection Clear for PWML output of the channel 3 Mask */
#define PWM_OSCUPD_OSCUPL3                  PWM_OSCUPD_OSCUPL3_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_OSCUPD_OSCUPL3_Msk instead */
#define PWM_OSCUPD_MASK                     _U_(0xF000F)                                   /**< \deprecated (PWM_OSCUPD) Register MASK  (Use PWM_OSCUPD_Msk instead)  */
#define PWM_OSCUPD_Msk                      _U_(0xF000F)                                   /**< (PWM_OSCUPD) Register Mask  */

#define PWM_OSCUPD_OSCUPH_Pos               0                                              /**< (PWM_OSCUPD Position) Output Selection Clear for PWMH output of the channel x */
#define PWM_OSCUPD_OSCUPH_Msk               (_U_(0xF) << PWM_OSCUPD_OSCUPH_Pos)            /**< (PWM_OSCUPD Mask) OSCUPH */
#define PWM_OSCUPD_OSCUPH(value)            (PWM_OSCUPD_OSCUPH_Msk & ((value) << PWM_OSCUPD_OSCUPH_Pos))  
#define PWM_OSCUPD_OSCUPL_Pos               16                                             /**< (PWM_OSCUPD Position) Output Selection Clear for PWML output of the channel 3 */
#define PWM_OSCUPD_OSCUPL_Msk               (_U_(0xF) << PWM_OSCUPD_OSCUPL_Pos)            /**< (PWM_OSCUPD Mask) OSCUPL */
#define PWM_OSCUPD_OSCUPL(value)            (PWM_OSCUPD_OSCUPL_Msk & ((value) << PWM_OSCUPD_OSCUPL_Pos))  

/* -------- PWM_FMR : (PWM Offset: 0x5c) (R/W 32) PWM Fault Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t FPOL:8;                    /**< bit:   0..7  Fault Polarity                           */
    uint32_t FMOD:8;                    /**< bit:  8..15  Fault Activation Mode                    */
    uint32_t FFIL:8;                    /**< bit: 16..23  Fault Filtering                          */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_FMR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_FMR_OFFSET                      (0x5C)                                        /**<  (PWM_FMR) PWM Fault Mode Register  Offset */

#define PWM_FMR_FPOL_Pos                    0                                              /**< (PWM_FMR) Fault Polarity Position */
#define PWM_FMR_FPOL_Msk                    (_U_(0xFF) << PWM_FMR_FPOL_Pos)                /**< (PWM_FMR) Fault Polarity Mask */
#define PWM_FMR_FPOL(value)                 (PWM_FMR_FPOL_Msk & ((value) << PWM_FMR_FPOL_Pos))
#define PWM_FMR_FMOD_Pos                    8                                              /**< (PWM_FMR) Fault Activation Mode Position */
#define PWM_FMR_FMOD_Msk                    (_U_(0xFF) << PWM_FMR_FMOD_Pos)                /**< (PWM_FMR) Fault Activation Mode Mask */
#define PWM_FMR_FMOD(value)                 (PWM_FMR_FMOD_Msk & ((value) << PWM_FMR_FMOD_Pos))
#define PWM_FMR_FFIL_Pos                    16                                             /**< (PWM_FMR) Fault Filtering Position */
#define PWM_FMR_FFIL_Msk                    (_U_(0xFF) << PWM_FMR_FFIL_Pos)                /**< (PWM_FMR) Fault Filtering Mask */
#define PWM_FMR_FFIL(value)                 (PWM_FMR_FFIL_Msk & ((value) << PWM_FMR_FFIL_Pos))
#define PWM_FMR_MASK                        _U_(0xFFFFFF)                                  /**< \deprecated (PWM_FMR) Register MASK  (Use PWM_FMR_Msk instead)  */
#define PWM_FMR_Msk                         _U_(0xFFFFFF)                                  /**< (PWM_FMR) Register Mask  */


