Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/pwm.h
#define PWM_WPSR_WPSWS_Pos                  0                                              /**< (PWM_WPSR Position) Write Protect SW Status */
#define PWM_WPSR_WPSWS_Msk                  (_U_(0x3F) << PWM_WPSR_WPSWS_Pos)              /**< (PWM_WPSR Mask) WPSWS */
#define PWM_WPSR_WPSWS(value)               (PWM_WPSR_WPSWS_Msk & ((value) << PWM_WPSR_WPSWS_Pos))  
#define PWM_WPSR_WPHWS_Pos                  8                                              /**< (PWM_WPSR Position) Write Protect HW Status */
#define PWM_WPSR_WPHWS_Msk                  (_U_(0x3F) << PWM_WPSR_WPHWS_Pos)              /**< (PWM_WPSR Mask) WPHWS */
#define PWM_WPSR_WPHWS(value)               (PWM_WPSR_WPHWS_Msk & ((value) << PWM_WPSR_WPHWS_Pos))  

/* -------- PWM_CMUPD0 : (PWM Offset: 0x400) (/W 32) PWM Channel Mode Update Register (ch_num = 0) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :9;                        /**< bit:   0..8  Reserved */
    uint32_t CPOLUP:1;                  /**< bit:      9  Channel Polarity Update                  */
    uint32_t :3;                        /**< bit: 10..12  Reserved */
    uint32_t CPOLINVUP:1;               /**< bit:     13  Channel Polarity Inversion Update        */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CMUPD0_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_CMUPD0_OFFSET                   (0x400)                                       /**<  (PWM_CMUPD0) PWM Channel Mode Update Register (ch_num = 0)  Offset */

#define PWM_CMUPD0_CPOLUP_Pos               9                                              /**< (PWM_CMUPD0) Channel Polarity Update Position */
#define PWM_CMUPD0_CPOLUP_Msk               (_U_(0x1) << PWM_CMUPD0_CPOLUP_Pos)            /**< (PWM_CMUPD0) Channel Polarity Update Mask */
#define PWM_CMUPD0_CPOLUP                   PWM_CMUPD0_CPOLUP_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMUPD0_CPOLUP_Msk instead */
#define PWM_CMUPD0_CPOLINVUP_Pos            13                                             /**< (PWM_CMUPD0) Channel Polarity Inversion Update Position */
#define PWM_CMUPD0_CPOLINVUP_Msk            (_U_(0x1) << PWM_CMUPD0_CPOLINVUP_Pos)         /**< (PWM_CMUPD0) Channel Polarity Inversion Update Mask */
#define PWM_CMUPD0_CPOLINVUP                PWM_CMUPD0_CPOLINVUP_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMUPD0_CPOLINVUP_Msk instead */
#define PWM_CMUPD0_MASK                     _U_(0x2200)                                    /**< \deprecated (PWM_CMUPD0) Register MASK  (Use PWM_CMUPD0_Msk instead)  */
#define PWM_CMUPD0_Msk                      _U_(0x2200)                                    /**< (PWM_CMUPD0) Register Mask  */


/* -------- PWM_CMUPD1 : (PWM Offset: 0x420) (/W 32) PWM Channel Mode Update Register (ch_num = 1) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :9;                        /**< bit:   0..8  Reserved */
    uint32_t CPOLUP:1;                  /**< bit:      9  Channel Polarity Update                  */
    uint32_t :3;                        /**< bit: 10..12  Reserved */
    uint32_t CPOLINVUP:1;               /**< bit:     13  Channel Polarity Inversion Update        */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CMUPD1_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_CMUPD1_OFFSET                   (0x420)                                       /**<  (PWM_CMUPD1) PWM Channel Mode Update Register (ch_num = 1)  Offset */

#define PWM_CMUPD1_CPOLUP_Pos               9                                              /**< (PWM_CMUPD1) Channel Polarity Update Position */
#define PWM_CMUPD1_CPOLUP_Msk               (_U_(0x1) << PWM_CMUPD1_CPOLUP_Pos)            /**< (PWM_CMUPD1) Channel Polarity Update Mask */
#define PWM_CMUPD1_CPOLUP                   PWM_CMUPD1_CPOLUP_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMUPD1_CPOLUP_Msk instead */
#define PWM_CMUPD1_CPOLINVUP_Pos            13                                             /**< (PWM_CMUPD1) Channel Polarity Inversion Update Position */
#define PWM_CMUPD1_CPOLINVUP_Msk            (_U_(0x1) << PWM_CMUPD1_CPOLINVUP_Pos)         /**< (PWM_CMUPD1) Channel Polarity Inversion Update Mask */
#define PWM_CMUPD1_CPOLINVUP                PWM_CMUPD1_CPOLINVUP_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMUPD1_CPOLINVUP_Msk instead */
#define PWM_CMUPD1_MASK                     _U_(0x2200)                                    /**< \deprecated (PWM_CMUPD1) Register MASK  (Use PWM_CMUPD1_Msk instead)  */
#define PWM_CMUPD1_Msk                      _U_(0x2200)                                    /**< (PWM_CMUPD1) Register Mask  */


/* -------- PWM_ETRG1 : (PWM Offset: 0x42c) (R/W 32) PWM External Trigger Register (trg_num = 1) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t MAXCNT:24;                 /**< bit:  0..23  Maximum Counter value                    */
    uint32_t TRGMODE:2;                 /**< bit: 24..25  External Trigger Mode                    */
    uint32_t :2;                        /**< bit: 26..27  Reserved */
    uint32_t TRGEDGE:1;                 /**< bit:     28  Edge Selection                           */
    uint32_t TRGFILT:1;                 /**< bit:     29  Filtered input                           */
    uint32_t TRGSRC:1;                  /**< bit:     30  Trigger Source                           */
    uint32_t RFEN:1;                    /**< bit:     31  Recoverable Fault Enable                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_ETRG1_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_ETRG1_OFFSET                    (0x42C)                                       /**<  (PWM_ETRG1) PWM External Trigger Register (trg_num = 1)  Offset */

#define PWM_ETRG1_MAXCNT_Pos                0                                              /**< (PWM_ETRG1) Maximum Counter value Position */
#define PWM_ETRG1_MAXCNT_Msk                (_U_(0xFFFFFF) << PWM_ETRG1_MAXCNT_Pos)        /**< (PWM_ETRG1) Maximum Counter value Mask */
#define PWM_ETRG1_MAXCNT(value)             (PWM_ETRG1_MAXCNT_Msk & ((value) << PWM_ETRG1_MAXCNT_Pos))
#define PWM_ETRG1_TRGMODE_Pos               24                                             /**< (PWM_ETRG1) External Trigger Mode Position */
#define PWM_ETRG1_TRGMODE_Msk               (_U_(0x3) << PWM_ETRG1_TRGMODE_Pos)            /**< (PWM_ETRG1) External Trigger Mode Mask */
#define PWM_ETRG1_TRGMODE(value)            (PWM_ETRG1_TRGMODE_Msk & ((value) << PWM_ETRG1_TRGMODE_Pos))
#define   PWM_ETRG1_TRGMODE_OFF_Val         _U_(0x0)                                       /**< (PWM_ETRG1) External trigger is not enabled.  */
#define   PWM_ETRG1_TRGMODE_MODE1_Val       _U_(0x1)                                       /**< (PWM_ETRG1) External PWM Reset Mode  */
#define   PWM_ETRG1_TRGMODE_MODE2_Val       _U_(0x2)                                       /**< (PWM_ETRG1) External PWM Start Mode  */
#define   PWM_ETRG1_TRGMODE_MODE3_Val       _U_(0x3)                                       /**< (PWM_ETRG1) Cycle-by-cycle Duty Mode  */
#define PWM_ETRG1_TRGMODE_OFF               (PWM_ETRG1_TRGMODE_OFF_Val << PWM_ETRG1_TRGMODE_Pos)  /**< (PWM_ETRG1) External trigger is not enabled. Position  */
#define PWM_ETRG1_TRGMODE_MODE1             (PWM_ETRG1_TRGMODE_MODE1_Val << PWM_ETRG1_TRGMODE_Pos)  /**< (PWM_ETRG1) External PWM Reset Mode Position  */
#define PWM_ETRG1_TRGMODE_MODE2             (PWM_ETRG1_TRGMODE_MODE2_Val << PWM_ETRG1_TRGMODE_Pos)  /**< (PWM_ETRG1) External PWM Start Mode Position  */
#define PWM_ETRG1_TRGMODE_MODE3             (PWM_ETRG1_TRGMODE_MODE3_Val << PWM_ETRG1_TRGMODE_Pos)  /**< (PWM_ETRG1) Cycle-by-cycle Duty Mode Position  */
#define PWM_ETRG1_TRGEDGE_Pos               28                                             /**< (PWM_ETRG1) Edge Selection Position */
#define PWM_ETRG1_TRGEDGE_Msk               (_U_(0x1) << PWM_ETRG1_TRGEDGE_Pos)            /**< (PWM_ETRG1) Edge Selection Mask */
#define PWM_ETRG1_TRGEDGE                   PWM_ETRG1_TRGEDGE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ETRG1_TRGEDGE_Msk instead */
#define   PWM_ETRG1_TRGEDGE_FALLING_ZERO_Val _U_(0x0)                                       /**< (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0  */
#define   PWM_ETRG1_TRGEDGE_RISING_ONE_Val  _U_(0x1)                                       /**< (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1  */
#define PWM_ETRG1_TRGEDGE_FALLING_ZERO      (PWM_ETRG1_TRGEDGE_FALLING_ZERO_Val << PWM_ETRG1_TRGEDGE_Pos)  /**< (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0 Position  */
#define PWM_ETRG1_TRGEDGE_RISING_ONE        (PWM_ETRG1_TRGEDGE_RISING_ONE_Val << PWM_ETRG1_TRGEDGE_Pos)  /**< (PWM_ETRG1) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1 Position  */
#define PWM_ETRG1_TRGFILT_Pos               29                                             /**< (PWM_ETRG1) Filtered input Position */
#define PWM_ETRG1_TRGFILT_Msk               (_U_(0x1) << PWM_ETRG1_TRGFILT_Pos)            /**< (PWM_ETRG1) Filtered input Mask */
#define PWM_ETRG1_TRGFILT                   PWM_ETRG1_TRGFILT_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ETRG1_TRGFILT_Msk instead */
#define PWM_ETRG1_TRGSRC_Pos                30                                             /**< (PWM_ETRG1) Trigger Source Position */
#define PWM_ETRG1_TRGSRC_Msk                (_U_(0x1) << PWM_ETRG1_TRGSRC_Pos)             /**< (PWM_ETRG1) Trigger Source Mask */
#define PWM_ETRG1_TRGSRC                    PWM_ETRG1_TRGSRC_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ETRG1_TRGSRC_Msk instead */
#define PWM_ETRG1_RFEN_Pos                  31                                             /**< (PWM_ETRG1) Recoverable Fault Enable Position */
#define PWM_ETRG1_RFEN_Msk                  (_U_(0x1) << PWM_ETRG1_RFEN_Pos)               /**< (PWM_ETRG1) Recoverable Fault Enable Mask */
#define PWM_ETRG1_RFEN                      PWM_ETRG1_RFEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_ETRG1_RFEN_Msk instead */
#define PWM_ETRG1_MASK                      _U_(0xF3FFFFFF)                                /**< \deprecated (PWM_ETRG1) Register MASK  (Use PWM_ETRG1_Msk instead)  */
#define PWM_ETRG1_Msk                       _U_(0xF3FFFFFF)                                /**< (PWM_ETRG1) Register Mask  */


/* -------- PWM_LEBR1 : (PWM Offset: 0x430) (R/W 32) PWM Leading-Edge Blanking Register (trg_num = 1) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t LEBDELAY:7;                /**< bit:   0..6  Leading-Edge Blanking Delay for TRGINx   */
    uint32_t :9;                        /**< bit:  7..15  Reserved */
    uint32_t PWMLFEN:1;                 /**< bit:     16  PWML Falling Edge Enable                 */
    uint32_t PWMLREN:1;                 /**< bit:     17  PWML Rising Edge Enable                  */
    uint32_t PWMHFEN:1;                 /**< bit:     18  PWMH Falling Edge Enable                 */
    uint32_t PWMHREN:1;                 /**< bit:     19  PWMH Rising Edge Enable                  */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_LEBR1_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_LEBR1_OFFSET                    (0x430)                                       /**<  (PWM_LEBR1) PWM Leading-Edge Blanking Register (trg_num = 1)  Offset */

