Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/pwm.h
#define PWM_LEBR1_LEBDELAY_Pos              0                                              /**< (PWM_LEBR1) Leading-Edge Blanking Delay for TRGINx Position */
#define PWM_LEBR1_LEBDELAY_Msk              (_U_(0x7F) << PWM_LEBR1_LEBDELAY_Pos)          /**< (PWM_LEBR1) Leading-Edge Blanking Delay for TRGINx Mask */
#define PWM_LEBR1_LEBDELAY(value)           (PWM_LEBR1_LEBDELAY_Msk & ((value) << PWM_LEBR1_LEBDELAY_Pos))
#define PWM_LEBR1_PWMLFEN_Pos               16                                             /**< (PWM_LEBR1) PWML Falling Edge Enable Position */
#define PWM_LEBR1_PWMLFEN_Msk               (_U_(0x1) << PWM_LEBR1_PWMLFEN_Pos)            /**< (PWM_LEBR1) PWML Falling Edge Enable Mask */
#define PWM_LEBR1_PWMLFEN                   PWM_LEBR1_PWMLFEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_LEBR1_PWMLFEN_Msk instead */
#define PWM_LEBR1_PWMLREN_Pos               17                                             /**< (PWM_LEBR1) PWML Rising Edge Enable Position */
#define PWM_LEBR1_PWMLREN_Msk               (_U_(0x1) << PWM_LEBR1_PWMLREN_Pos)            /**< (PWM_LEBR1) PWML Rising Edge Enable Mask */
#define PWM_LEBR1_PWMLREN                   PWM_LEBR1_PWMLREN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_LEBR1_PWMLREN_Msk instead */
#define PWM_LEBR1_PWMHFEN_Pos               18                                             /**< (PWM_LEBR1) PWMH Falling Edge Enable Position */
#define PWM_LEBR1_PWMHFEN_Msk               (_U_(0x1) << PWM_LEBR1_PWMHFEN_Pos)            /**< (PWM_LEBR1) PWMH Falling Edge Enable Mask */
#define PWM_LEBR1_PWMHFEN                   PWM_LEBR1_PWMHFEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_LEBR1_PWMHFEN_Msk instead */
#define PWM_LEBR1_PWMHREN_Pos               19                                             /**< (PWM_LEBR1) PWMH Rising Edge Enable Position */
#define PWM_LEBR1_PWMHREN_Msk               (_U_(0x1) << PWM_LEBR1_PWMHREN_Pos)            /**< (PWM_LEBR1) PWMH Rising Edge Enable Mask */
#define PWM_LEBR1_PWMHREN                   PWM_LEBR1_PWMHREN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_LEBR1_PWMHREN_Msk instead */
#define PWM_LEBR1_MASK                      _U_(0xF007F)                                   /**< \deprecated (PWM_LEBR1) Register MASK  (Use PWM_LEBR1_Msk instead)  */
#define PWM_LEBR1_Msk                       _U_(0xF007F)                                   /**< (PWM_LEBR1) Register Mask  */


/* -------- PWM_CMUPD2 : (PWM Offset: 0x440) (/W 32) PWM Channel Mode Update Register (ch_num = 2) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :9;                        /**< bit:   0..8  Reserved */
    uint32_t CPOLUP:1;                  /**< bit:      9  Channel Polarity Update                  */
    uint32_t :3;                        /**< bit: 10..12  Reserved */
    uint32_t CPOLINVUP:1;               /**< bit:     13  Channel Polarity Inversion Update        */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_CMUPD2_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PWM_CMUPD2_OFFSET                   (0x440)                                       /**<  (PWM_CMUPD2) PWM Channel Mode Update Register (ch_num = 2)  Offset */

#define PWM_CMUPD2_CPOLUP_Pos               9                                              /**< (PWM_CMUPD2) Channel Polarity Update Position */
#define PWM_CMUPD2_CPOLUP_Msk               (_U_(0x1) << PWM_CMUPD2_CPOLUP_Pos)            /**< (PWM_CMUPD2) Channel Polarity Update Mask */
#define PWM_CMUPD2_CPOLUP                   PWM_CMUPD2_CPOLUP_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMUPD2_CPOLUP_Msk instead */
#define PWM_CMUPD2_CPOLINVUP_Pos            13                                             /**< (PWM_CMUPD2) Channel Polarity Inversion Update Position */
#define PWM_CMUPD2_CPOLINVUP_Msk            (_U_(0x1) << PWM_CMUPD2_CPOLINVUP_Pos)         /**< (PWM_CMUPD2) Channel Polarity Inversion Update Mask */
#define PWM_CMUPD2_CPOLINVUP                PWM_CMUPD2_CPOLINVUP_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PWM_CMUPD2_CPOLINVUP_Msk instead */
#define PWM_CMUPD2_MASK                     _U_(0x2200)                                    /**< \deprecated (PWM_CMUPD2) Register MASK  (Use PWM_CMUPD2_Msk instead)  */
#define PWM_CMUPD2_Msk                      _U_(0x2200)                                    /**< (PWM_CMUPD2) Register Mask  */


/* -------- PWM_ETRG2 : (PWM Offset: 0x44c) (R/W 32) PWM External Trigger Register (trg_num = 2) -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t MAXCNT:24;                 /**< bit:  0..23  Maximum Counter value                    */
    uint32_t TRGMODE:2;                 /**< bit: 24..25  External Trigger Mode                    */
    uint32_t :2;                        /**< bit: 26..27  Reserved */
    uint32_t TRGEDGE:1;                 /**< bit:     28  Edge Selection                           */
    uint32_t TRGFILT:1;                 /**< bit:     29  Filtered input                           */
    uint32_t TRGSRC:1;                  /**< bit:     30  Trigger Source                           */
    uint32_t RFEN:1;                    /**< bit:     31  Recoverable Fault Enable                 */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PWM_ETRG2_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

